
%% 配色数据保存
mycolor = [0.474509803921569,0.650980392156863,0.807843137254902;...
           0.682352941176471,0.823529411764706,0.898039215686275;...
           0.941176470588235,0.972549019607843,0.862745098039216;...
           0.992156862745098,0.968627450980392,0.705882352941177;...
           1,0.901960784313726,0.603921568627451];
%% 随机生成相关性系数矩阵
clc;
clear;
close all;
%X为0-1矩阵 
X = rand(13);
%获取矩阵的列数
X = round(X,2);
%制造全是1的向量
B = ones(1,size(X,1));
% 替换X矩阵对角元素，使其均为1
X(logical(eye(size(X))))=B;

%% 开始绘制热图
% 命名所有变量名字，这里大家可以替换成自己需要的变量名
label_name = {'N1','N2','N3','N4','N5','N6','N7','N8','N9','N10','N11','N12','N13'};
xlabel_name = label_name;
ylabel_name = label_name;
% 热图函数为heatmap;开始绘制
hot_figure = heatmap(xlabel_name,ylabel_name,X,'FontSize',10,'FontName','Adobe Arabic');
hot_figure.GridVisible = 'off';
% 设置坐标区名字与图的大标题
hot_figure.Title = 'Heated';
hot_figure.XLabel = 'xlabel';
hot_figure.YLabel = 'ylabel';

%% 对热图上色—colormap函数
% 自己可以设定颜色RGB值
mycolor = [0.474509803921569,0.650980392156863,0.807843137254902;...
           0.682352941176471,0.823529411764706,0.898039215686275;...
           0.941176470588235,0.972549019607843,0.862745098039216;...
           0.992156862745098,0.968627450980392,0.705882352941177;...
           1,0.901960784313726,0.603921568627451];
colormap(gca,mycolor);










