%% 导入数据文件
clc;
clear;
load t.mat;%矩阵大小5*2095
load Y.mat;%矩阵大小5*2095
% 5对应曲线数量、2095是大家自己的数据点
%% 导入配色文件
mycolor = [0.980392156862745,0.709803921568628,0.615686274509804;...
    0.956862745098039,0.533333333333333,0.415686274509804;...
    0.788235294117647,0.886274509803922,0.941176470588235;...
    0.501960784313726,0.635294117647059,0.752941176470588;...
    0.721568627450980,0.760784313725490,0.549019607843137];
%% 开始绘图 所用函数为area
figure('color',[ 1 1 1]);
% 参数设置主要为线宽、面积颜色、阴影系数
for i = 1:size(t,1)% size函数读取数据矩阵行数
    area(t(i,:),Y(i,:),'Linewidth',1.5,'FaceColor',mycolor(i,:),'EdgeColor',mycolor(i,:),'FaceAlpha',0.4);
    hold on;
end
%% 添加图例与轴标题
xlabel('t');
ylabel('Y');
title('面积填充图');
legend('y = t1','y = t2','y = t3','y = t4','y = t5');
set(gca,'Linewidth',1);
% 简单好看的面积图就可以保存啦
